[
    {
        "id": 1,
        "name": "Frontend",
        "subcategories": [
            {
                "id": 1,
                "name": "HTML5",
                "description": "A versão mais recente do HTML, usada para estruturar conteúdo web."
            },
            {
                "id": 2,
                "name": "CSS3",
                "description": "A última versão do CSS, usada para estilizar páginas web."
            },
            {
                "id": 3,
                "name": "JavaScript",
                "description": "Linguagem essencial para criar interatividade e dinamicidade em páginas web."
            },
            {
                "id": 4,
                "name": "React",
                "description": "Biblioteca JavaScript para construir interfaces de usuário dinâmicas e reativas."
            },
            {
                "id": 9,
                "name": "TypeScript",
                "description": "Superset do JavaScript que adiciona tipagem estática, ajudando no desenvolvimento mais seguro."
            },
            {
                "id": 10,
                "name": "Next.js",
                "description": "Framework React para renderização do lado do servidor e geração de sites estáticos."
            },
            {
                "id": 11,
                "name": "Tailwind CSS",
                "description": "Framework CSS utilitário que permite a criação de layouts responsivos e personalizados de forma rápida e eficiente."
            }
        ]
    },
    {
        "id": 2,
        "name": "Backend",
        "subcategories": [
            {
                "id": 1,
                "name": "Node.js",
                "description": "Ambiente de execução para JavaScript no lado do servidor, permitindo a criação de aplicações escaláveis."
            },
            {
                "id": 2,
                "name": "Express.js",
                "description": "Framework minimalista e flexível para Node.js, focado na criação de APIs."
            },
            {
                "id": 3,
                "name": "Java",
                "description": "Linguagem de programação amplamente utilizada para backends robustos e escaláveis."
            },
            {
                "id": 4,
                "name": "Spring Boot",
                "description": "Framework Java para construir aplicações de backend escaláveis, com foco em microservices."
            },
            {
                "id": 10,
                "name": "GraphQL",
                "description": "Linguagem de consulta para APIs, oferecendo uma maneira mais eficiente de buscar dados do que REST."
            },
            {
                "id": 11,
                "name": "REST API",
                "description": "Estilo de arquitetura para criar APIs baseadas em HTTP, amplamente utilizado em backend."
            },
            {
                "id": 12,
                "name": "Next.js",
                "description": "Framework React que pode ser usado também no backend para renderização do lado do servidor (SSR) e geração de sites estáticos (SSG)."
            }
        ]
    }
]